---
kind: type
id: T:Autodesk.Revit.DB.FabricationDimensionDefinition
source: html/cfa213e3-6734-2321-4849-c6e159d77fd0.htm
---
# Autodesk.Revit.DB.FabricationDimensionDefinition

Fabricaition dimension definition

## Syntax (C#)
```csharp
public class FabricationDimensionDefinition : IDisposable
```